In [9]:
#load the necessary libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")
import os

In [15]:
os.getcwd()

'/Users/cholponzhakshylykova/Desktop/SDS/Heart-Attack-Risk'

In [19]:
#import the data
data = pd.read_csv("/Users/cholponzhakshylykova/Desktop/SDS/Heart-Attack-Risk/heart_failure.csv")

In [33]:
#data exploration
data.head()
data.info()
#data.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       299 non-null    float64
 1   anaemia                   299 non-null    int64
 2   creatinine_phosphokinase  299 non-null    int64
 3   diabetes                  299 non-null    int64
 4   ejection_fraction         299 non-null    int64
 5   high_blood_pressure       299 non-null    int64
 6   platelets                 299 non-null    float64
 7   serum_creatinine          299 non-null    float64
 8   serum_sodium              299 non-null    int64
 9   sex                       299 non-null    int64
 10  smoking                   299 non-null    int64
 11  time                      299 non-null    int64
 12  DEATH_EVENT               299 non-null    int64
dtypes: float64(3), int64(10)
memory usage: 30.5 KB

In [35]:
data.head()

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,high_blood_pressure,platelets,serum_creatinine,serum_sodium,sex,smoking,time,DEATH_EVENT
0,75.0,0,582,0,20,1,265000.00,1.9,130,1,0,4,1
1,55.0,0,7861,0,38,0,263358.03,1.1,136,1,0,6,1
2,65.0,0,146,0,20,0,162000.00,1.3,129,1,1,7,1
3,50.0,1,111,0,20,0,210000.00,1.9,137,1,0,7,1
4,65.0,1,160,1,20,0,327000.00,2.7,116,0,0,8,1

In [37]:
data.columns

Index(['age', 'anaemia', 'creatinine_phosphokinase', 'diabetes',
       'ejection_fraction', 'high_blood_pressure', 'platelets',
       'serum_creatinine', 'serum_sodium', 'sex', 'smoking', 'time',
       'DEATH_EVENT'],
      dtype='object')

In [39]:
#some columns names are very long therefore I want to rename them. 
data.columns = ['age', 'anaemia', 'CP', 'diabetes', \
       'EF', 'HBP', 'platelets', \
       'SC', 'Na', 'sex', 'smoking', 'time', \
       'death']

In [43]:
data.head()

,age,anaemia,CP,diabetes,EF,HBP,platelets,SC,Na,sex,smoking,time,death
0,75.0,0,582,0,20,1,265000.00,1.9,130,1,0,4,1
1,55.0,0,7861,0,38,0,263358.03,1.1,136,1,0,6,1
2,65.0,0,146,0,20,0,162000.00,1.3,129,1,1,7,1
3,50.0,1,111,0,20,0,210000.00,1.9,137,1,0,7,1
4,65.0,1,160,1,20,0,327000.00,2.7,116,0,0,8,1

In [45]:
#convert columns with  0,1 data into categorical data
data.anaemia = data.anaemia.astype("category")
data.diabetes = data.diabetes.astype("category")
data.HBP = data.HBP.astype("category")
data.sex = data.sex.astype("category")
data.smoking = data.smoking.astype("category")
data.death = data.death.astype("category")

In [47]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        299 non-null    float64
 1   anaemia    299 non-null    category
 2   CP         299 non-null    int64
 3   diabetes   299 non-null    category
 4   EF         299 non-null    int64
 5   HBP        299 non-null    category
 6   platelets  299 non-null    float64
 7   SC         299 non-null    float64
 8   Na         299 non-null    int64
 9   sex        299 non-null    category
 10  smoking    299 non-null    category
 11  time       299 non-null    int64
 12  death      299 non-null    category
dtypes: category(6), float64(3), int64(4)
memory usage: 19.0 KB

In [49]:
data.death.cat.categories

Index([0, 1], dtype='int64')

In [51]:
data[data.columns[]]

TypeError: DataFrame.isna() takes 1 positional argument but 2 were given